from frozendict import frozendict

DICT = frozendict(
    {
        "hello": '👋 Привет, {name}! \n\nЯ, бот-помощник команды "Я тебя слышу".\n\n' "О чьем слухе вы волнуетесь?",
        "good_choise": "Отличный выбор кнопки! 🤝",
        "self_hearing_intro": "Понимаю ваше волнение о собственном слухе.\n\n"
        "Выберите действие ниже: можно пройти онлайн-тест, узнать о симптомах и вернуться в меню в любой момент.",

        "check_hearing_intro": "Если вы замечаете проблемы со слухом, важно действовать.\n\n"
        "Выберите вариант ниже, чтобы пройти тест или узнать больше о симптомах.",
        
        "check_hearing_links_intro": "Готовы проверить слух прямо сейчас?\n\n"
        "Запустите онлайн-тест или изучите статью с полезными советами.",
    }
)

DICT_KB = frozendict(
    {
        "button_1": "Я волнуюсь о слухе ребёнка",
        "button_2": "Я волнуюсь о своём слухе",
        "button_3": "Замечаю проблемы со слухом",
        "button_4": "Истории о людях\n(Не работает)",
        "button_5": "Хочу узнать про заботу о слухе\n(Не работает)",
        "button_6": "Проверить слух",
        "button_7": "Узнать о симптомах\n(Не работает)",
        "check_hearing_test": "Пройти онлайн-тест",
        "check_hearing_article": "Прочитать статью «8 причин»",
        "go_home": "Вернуться в главное меню",
    }
)
